Weapon = {}
--------------------------------AA---------------------------------
Weapon.ATA_Zero = {
  "AIM-54A-Mk47 空空导弹",
  "AIM-54A-Mk60 空空导弹",
  "AIM-54C-Mk47 空空导弹",
}
Weapon.ATA_ZeroPoint = 80

Weapon.ATA_One = {
  "SD-10 空空导弹",
}
Weapon.ATA_OnePoint = 20

--次强
Weapon.ATA_Two = {
  "AIM-120C-5 空空导弹",
  "AIM-120B 空空导弹",
  "R-27ET 空空导弹",
  "R-77 空空导弹",
  "ADM-141A 战术诱饵导弹",
  "AIM-9X 空空导弹",
  "MBDA Mistral",
  --小羚羊对空
}
Weapon.ATA_TwoPoint = 10

--中
Weapon.ATA_Three = {"R-27ER 空空导弹", "Matra_S530D",  "R-27R 空空导弹", "R-27T 空空导弹"}
Weapon.ATA_ThreePoint = 8

Weapon.ATA_Four = {
  "R-73 空空导弹",
  "R-60M 空空导弹",
  "MMagicII",
  --魔术
  --'R.550 Magic 2',
  "R-27T 空空导弹",
  "PL-5EII 空空导弹",
  "AIM-9M 空空导弹",
  "RB-24J 空空导弹",
  "RB-74 空空导弹",
  "AIM-9L 空空导弹",
  "R-60 空空导弹",
  "RB-24空空导弹",
  "AIM-7M 空空导弹", 
  "AIM-7F 空空导弹",
  "AIM-7E 空空导弹", 
  "AIM-7MH 空空导弹"
}
Weapon.ATA_FourPoint = 5


-----------------------------------AG----------------------------------
Weapon.ATG_One = {
  "GBU-31(V)1/B 炸弹",
  "GBU-31(V)2/B",
  "GBU-31(V)3/B 炸弹",
  "GBU-31(V)4/B",
  "AGM-154C 联合防区外武器",
  "AGM-154A 联合防区外武器",
  "GB-6 防区外布撒器 (集束)",
  "GB-6 防区外布撒器 (高爆)",

  'AGM-62 "白星眼" 电视制导炸弹',

}
Weapon.ATG_OnePoint = 50

Weapon.ATG_Two = {
  "GBU-32(V)2/B",
  "AGM-88C 反辐射导弹",
  "LS-6 500千克 滑翔炸弹",
  --"CBU-97 炸弹",
  "GBU-54(V)1/B",
  "Kh-58U 反辐射导弹",
  "AGM-84E 防区外对地导弹",
  --"CM-802AKG 空地导弹",
  "AGM-84D 反舰导弹",
  "C-802AK 空舰导弹",
  "LD-10 反辐射导弹",
  --"BK90 MJ1",
  --"BK90 MJ1-MJ2",
  --"BK90 MJ2"
  "AGM-65H 空地导弹",
  "AGM-65K 空地导弹",
  "AGM-65F 空地导弹",
  "AGM-65D 空地导弹",
  "AGM-65G 空地导弹",
  "AGM-65E 空地导弹",
  "AGM-65L 空地导弹",
}
Weapon.ATG_TwoPoint = 20

Weapon.ATG_Three = {
  "AGM-114K",
  "M151-HE APKWS",
  "M282-MPP APKWS",
  "AGM-122 反辐射导弹",
  --"CBU-97 炸弹",
  --"CBU-105 炸弹",
  "GBU-12 炸弹",
  "GBU-16 炸弹",
  "GBU-10 炸弹",
  "GBU-24 炸弹",
  "GBU-38 炸弹",

  --"AGM-62 电视制导炸弹",
  "Kh-29L 激光制导导弹",
  "Kh-25ML 激光制导导弹",
  "S-25L 激光制导火箭弹",
  "Kh-25MP 反辐射导弹",
  "Kh-25MPU 反辐射导弹",
  "KAB-500kr",
  "C-701 空地导弹(电视)",
  "C-701 空地导弹(红外)",
  "BRM-1 90毫米火箭弹",
  --'BLG-66 "白鲸" 集束炸弹',
  --幻影
  --"CBU-103 炸弹",
  "KAB-500Kr 光电电视制导炸弹",
  "Kh-29T 电视制导导弹",
  "MINGR55",
  "RB-24J空空导弹",
  "ARAK M70B高爆",
  "ARAK M70B穿甲",
  '9A4172M "旋风-M" 反坦克导弹',--筷子
  --"CBU-87 炸弹",
}
Weapon.ATG_ThreePoint = 10

----------------------吊舱-------------------
Weapon.ATGPod = {
  "AN/AAQ-28 LITENING 瞄准吊舱",
  "ALQ-184 电子对抗吊舱",
  "ALQ-131 电子对抗吊舱",
  "MPS-410 电子对抗吊舱",
  "AN/ALQ-164 电子对抗吊舱",
  "L-081 Fantasmagoria 电子情报吊舱",
  "Mercury 微光电视吊舱",
  "WMD7 吊舱",
  "数据链指令吊舱",
  "自保护干扰吊舱",
}
Weapon.ATGPodPoint = 50

-- ----------------------油箱-------------------------
Weapon.mailbox = {
  "1100升副油箱",
  "800升副油箱",
  "800升机翼副油箱",
  --25t
  "RPL 522 1300升 副油箱",
  "RPL 541 2000升 副油箱",
  "370加仑副油箱",
  "AERO 1D 300加仑 副油箱",
  --8B
  "300加仑副油箱",
  "330加仑副油箱",
  --备
  "FPU-8A 330加仑副油箱",
  "610加仑副油箱",
  "FT600 副油箱"
}
Weapon.mailboxPoint = 15

--数据库
-------以下暂时免费------
--"20毫米 高爆弹",
--"23毫米 高爆弹（曳光）",
--"30毫米 穿甲弹",
--"30毫米 高爆弹",
--"Mk-84 炸弹",
--"九头蛇-70 M151 火箭弹",
--"九头蛇-70 MK5 火箭弹",
--"DEFA554_30毫米口径高爆弹",
--"ADM-141A 战术诱饵导弹",
--"200A型反跑道炸弹",
--"Mk-82 炸弹",
--'Mk-82 "蛇眼" 炸弹',
--"BRM-1 90毫米火箭弹",
--
--"90毫米航空火箭弹",
--"祖尼-127 火箭弹",
--'Mk-20 "石眼" 集束炸弹',
--"Mk-83 炸弹",
--"Mk-82Y 炸弹",
--
----"CBU-99 炸弹",
--"S-8KOM 火箭弹",
--"S-13OF 火箭弹",
--"S-8OFP2 火箭弹",
--"PTAB_2_5KO",
--"S-8TsM 火箭弹",
--"S-8OM 火箭弹",
--"FAB-250 炸弹",
--"FAB-500 炸弹",
--"AO_2_5RT",
--"12.7毫米 曳光弹",
--"7.62毫米 曳光弹",
--"FAB-100 炸弹",
--"SAB-100 炸弹",
--"S-24B 火箭弹",
--"BetAB-500 炸弹",
--"HOT3 反坦克导弹",
--"LUU-2B 照明弹",
--"BDU-50HD 高阻训练弹",
--"BDU-50LGB 激光制导训练弹",
--"BDU-50LD 低阻训练弹",
--"BDU-33 训练弹",
--"BetAB-500ShP 动力混凝土穿透弹",
--"RBK-500U OAB-2.5RT 集束炸弹",
--"RBK-500 PTAB-1M 反坦克集束炸弹",
--"RBK-500-255 PTAB-10-5 反坦克炸弹",
--"RBK-250-275 AO-1 SCh 集束炸弹",
--"九头蛇-70 M274 火箭弹",
--"九头蛇-70 M257 火箭弹",
--"Mk-82 AIR 高阻炸弹",
--"九头蛇-70 M156 白磷火箭弹",
--"九头蛇-70 MK1 火箭弹",
--"九头蛇-70 MK61 火箭弹",
--"九头蛇-70 WTU-1/B 训练火箭弹",
--
--------------阿帕奇
--"九头蛇-70 M229 高爆两用火箭弹",
--"九头蛇-70 M282 多用途穿甲火箭弹",
--"九头蛇-70 M151 火箭弹",
--
--"M/71 高爆炸弹 (带减速伞)",
--"M/71 高爆炸弹",
--"RBK-250 炸弹",
--"HYDRA-70 HE APKWS",
--"HYDRA-70 MPP APKWS", --火箭
--"M-61 机炮",
--"GAU-8 机炮",
--
--"M242_Bushmaster",
--"M230 链炮",
--"2A42机炮",
--"2A38",
--"30毫米 穿甲弹",
--"30毫米 高爆弹",
--"25毫米 穿甲弹",
--"25毫米 高爆弹",
--"M242",
--"M56A3 20mm HEI" --机炮



env.info("武器信息已添加")
